**DataFrame :**

**Features:**
    
1. "DataFrame" is a Data structure used in python.

2. It is just like a table, containing multiple rows and columns

3. Every row of a DataFrame holds and index automatically and the index starts from 0.

4. Many Data Type like List, Dictionary, Series (Data Structure) and Numpy Array can be converted into a DataFrame using Pandas.

5. DataFrames are indexable both by column and row. Also one can subset a DataFrame based on conditions.

**Lets start working with DataFrame:-**

**Creation Of DataFrame:**

In [4]:
import pandas as pd #importing library
data = [7,8,9] #list
df = pd.DataFrame(data) #creating dataframe

In [5]:
df #no columns are assigned

   0
0  7
1  8
2  9

**By default every element has an index 0,1,2 and so on....**

In [6]:
data = [['Honey',15], ['Sugar', 25], ['Coffee',10]] #n-dimensional array
df = pd.DataFrame(data,columns=['Name','Packets']) #converting to dataframe

In [7]:
df #with column name

     Name  Packets
0   Honey       15
1   Sugar       25
2  Coffee       10

In [17]:
import numpy as np
ar = np.array([[1,2,3],[4,5,6],[6,7,8]]) #numpy multidimensional array
df=pd.DataFrame(ar) #converting an array to a dataframe

In [18]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  6  7  8

In [13]:
dictionary_1 = {'Honey':[1,2,3], 'Sugar':[2,3,4], 'Coffee':[3,4,5] } #creating dictionary
df = pd.DataFrame(dictionary_1) #converting the dictionary to dataframe

In [14]:
df

   Honey  Sugar  Coffee
0      1      2       3
1      2      3       4
2      3      4       5

**Setting index Manually**

In [19]:
df = pd.DataFrame(dictionary_1, index=['1st','2nd','3rd']) #with manual index

In [20]:
df

     Honey  Sugar  Coffee
1st      1      2       3
2nd      2      3       4
3rd      3      4       5

**Setting index and column names simultaneously:**

In [26]:
df = pd.DataFrame(ar, index=['Brand','Quality','Quantity'], columns=['Honey','Sugar','Coffee']) #setting index column manually

In [27]:
df

          Honey  Sugar  Coffee
Brand         1      2       3
Quality       4      5       6
Quantity      6      7       8

In [28]:
df2 = df[['Honey','Sugar']].copy() #creating new dataframe from an old one

In [29]:
df2

          Honey  Sugar
Brand         1      2
Quality       4      5
Quantity      6      7

**Indexing Columns and Rows from DataFrame**

In [31]:
df['Honey'] #indexing by column/taking only a column from the dataframe

Brand       1
Quality     4
Quantity    6
Name: Honey, dtype: int32

In [32]:
df[['Honey','Sugar']] #taking multiple columns from the dataframe

          Honey  Sugar
Brand         1      2
Quality       4      5
Quantity      6      7

In [36]:
c = pd.DataFrame([4,5,6], columns=['Chocolate']) #creating a new dataframe with a column I want to add
df['Chocolate'] = c['Chocolate'] #adding the new column to the existing dataframe

In [37]:
df

          Honey  Sugar  Coffee  Chocolate
Brand         1      2       3        NaN
Quality       4      5       6        NaN
Quantity      6      7       8        NaN

In [38]:
c = pd.DataFrame([4,5,6], index=['Brand','Quality','Quantity'], columns=['Chocolate'])

In [39]:
c

          Chocolate
Brand             4
Quality           5
Quantity          6

In [40]:
df['Chocolate'] = c['Chocolate']

In [41]:
df

          Honey  Sugar  Coffee  Chocolate
Brand         1      2       3          4
Quality       4      5       6          5
Quantity      6      7       8          6

**Thank You**